Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: it's "chrono life"!
es_419: ¡Es “Chrono Life”!

source: since there’s no turning back, maybe I’ll just go with a secretly op persona.
es_419: Como ya no hay vuelta atrás, quizá oculte mi imagen SP.

source: you did get stronger, undies!
es_419: ¡Sí que te volviste fuerte, Calzón!

source: how is he still fine after getting hit by me?
es_419: ¿Cómo es que está bien luego del golpe que le di?

source: good night!
es_419: ¡Buenas noches!

source: yeah, practicing a pretty useless skill if you ask me.
es_419: Sí, practicando una habilidad bastante inútil en mi opinión.

source: you’re already back?
es_419: ¿Ya volviste a aparecer?

source: my gosh.
es_419: Cielos.

source: hahaha, I know, right?
es_419: Ja, ja, ja, es verdad.

source: have you forgotten about this innocent act you put on for the entire nation?
es_419: ¿Te olvidas del papel de chica inocente que representas para todo el país?

source: she was a "fragment of god" after all.
es_419: Era un “fragmento de Dios”, al fin y al cabo.

source: this is dangerous. you stay back!
es_419: Esto es peligroso. ¡Tú no te metas!

source: ...kill three million users at once...
es_419: … matar a tres millones de jugadores de un golpe…

source: you didn’t need to put in any effort.
es_419: Ya no necesitabas hacer ningún esfuerzo.

source: there are always little trolls like you who don’t seem to understand how things work.
es_419: Siempre hay troles como tú que parecen no entender cómo funcionan las cosas.

source: within a blink of an eye, I became a millionaire.
es_419: En un abrir y cerrar de ojos, me convertí en millonario.

source: hammer of reinforcement, raises an item’s reinforcement level by +1.
es_419: Martillo de mejora: Mejora el nivel de un objeto en +1.

source: you really don’t know a thing about women, huh?
es_419: Realmente no sabe nada de mujeres, ¿no?

source: w-wait a minute...
es_419: U-un momento…

source: hya...
es_419: JIAA…

source: this wasn’t the direction I expected it to go.
es_419: No era el desenlace que yo esperaba.

source: thankfully, this man was able to help us.
es_419: Por suerte, este hombre pudo ayudarnos.

source: wooden stick
es_419: Palo de madera

source: since when were yo--
es_419: ¿Desde cuándo eres…?

source: episode 7. heavy spenders (1)
es_419: Episodio 7: Grandes consumidores (1)

source: scanning users online.
es_419: Buscando usuarios en línea.

source: I play games to have fun! why should I care about what other people think about that?!
es_419: ¡Jugar me divierte! ¡¿Por qué debería importarme lo que piensen los demás?!

source: master novice
es_419: Maestro novato

source: I told you we should’ve cut him off sooner.
es_419: Les dije que debíamos haberlo echado antes.

source: and I guarantee that they’re absolutely scrumptious.
es_419: Y te puedo garantizar que será algo absolutamente delicioso.

source: won
es_419: 12 039 433 921 WONES

source: I didn’t think people would notice...
es_419: No creí que la gente fuera a notar…

source: I think they... forgot about them.
es_419: Creo que… se las olvidaron.

source: m-mom...?
es_419: ¿M-mamá…?

source: ...happened a bit later.
es_419: … llegó un tiempo después.

source: ...a ton of expensive loot.
es_419: … un montón de objetos muy caros.

source: +1 wooden stick extra damage +1
es_419: Palo de madera +1 Daño extra +1

source: I had given up on getting my revenge.
es_419: Ya había abandonado la idea de vengarme.

source: good job!
es_419: ¡Buen trabajo!

source: that’s the main characteristic of an [old linnager].
es_419: Esa es la principal característica de un [viejo Linnager].

source: I’m going to...
es_419: Los voy…

source: that’s exactly what we’re going to do.
es_419: Eso es exactamente lo que haremos.

source: name: ji-u lee.
es_419: Nombre: Jiwoo Lee.

source: ...about one hour.
es_419: … cerca de una hora.

source: how can you even call him a brave warrior?!
es_419: ¡¿Cómo pueden llamarlo “guerrero valiente”?

source: stop pretending like you’ve got a chance.
es_419: no hagas como si tuvieras alguna oportunidad.

source: bunnybear lv.{j}4
es_419: OSONEJO NV. 4

source: hahahaha hahahaha!
es_419: ¡Ja, ja, ja, ja, ja, ja, ja, ja!

source: have you been eating wel--
es_419: ¿Has estado comiendo bi…?
